package ir.puyaars.plantsapp.repository.utils;

import android.content.Context;

import com.google.gson.Gson;
import com.google.gson.reflect.TypeToken;

import java.io.IOException;
import java.io.InputStream;
import java.lang.reflect.Type;
import java.nio.charset.StandardCharsets;
import java.util.ArrayList;
import java.util.List;

import ir.puyaars.plantsapp.R;
import ir.puyaars.plantsapp.repository.entities.PlantEntity;
import ir.puyaars.plantsapp.repository.entities.Spec;

public class SampleData {

    public static List<PlantEntity> getSampleData() {
        List<PlantEntity> entities = new ArrayList<>();

        List<Spec> specs1 = new ArrayList<>();
        specs1.add(new Spec("نور","نزدیک پنجچره یا نور غیر مستقیم نیم سایه نیم آفتاب نور دلخواه این گیاه است . مواظب اشعه مستقیم آفتاب باشید"));
        specs1.add(new Spec("دما","اگرچه تا 10 درجه سانتی گراد مقاومت دارد ولی کمتر از 13 درجه را دوست ندارد . در تابستان تا حدئد 30 درحه مقاومت می کند . ولی در درجات بالاتر غبارپاشی مداوم لازم است"));
        specs1.add(new Spec("آبیاری","آبیاری زیاده از اندازه برای این گیاه مضر و سطح خاک در فاصله دو آبیاری باید خشک شود . در تابستان هفته ای یکبار و در زمستان هر دو هفته یکبار احتیاج به آبیاری دارد . همیشه قبل از آبیاری رطوبت سطح خاک را بازدید کنید"));
        specs1.add(new Spec("رطوبت","در تابستان هفته ای دو تا سه بار و در زمستان هر هفته یکبار نیاز به غبارپاشی دارد. از آب ولرم و سبک فاقد املاح جهت غبارپاشی استفاده کنید"));
        specs1.add(new Spec("تغذیه","نیاز چندانی به تغذیه مصنوعی نیست و تغذیه بیش از اندازه باعث تجمع املاح در خاک می شوند در صورت نیاز هر ماه یکبار تغذیه مصنوعی کنید"));
        specs1.add(new Spec("خاک مناسب","خاک سبک لیمویی بهترین و مناسب ترین محیط برای رشد ریشه این گیاه است"));
        specs1.add(new Spec("تعویض گلدان","هر سال در فصل بهار با شروع فصل رشد احتیاج به تعویض گلدان دارد و در سالهای بعد با سنگین شدن گلدان تعویض خاک سطح گلدان با خاک نو و غنی پیشنهاد می گردد"));
        specs1.add(new Spec("تمیز کردن برگ ها","برگ ها را با احتیاط با پارچه یا اسفنج مرطوب تمیز کنید"));
        specs1.add(new Spec("ازدیاد","گرفتن قلمه در بهار . هر قلمه سه گره داشته باشد و در دمای 23 درجه ریشه دار گردد. ریشه های هوایی برگ انجیری را هرگز قطع نکنید بلکه با نصب قیم خزدار آنها را وادار به فرو رفتن در خزه مرطوب کنید."));
//        specs1.add(new Spec("",""));

        PlantEntity plant1 = new PlantEntity.Builder()
                .withName("برگ انجیری")
                .withNameRoot("اژبن( اژ=مار +  بن = ریشه) ( اشاره به ریشه های مار مانند آن است)")
                .withEnName("Swiss cheese plant")
                .withSiName("Monstera deliciosa")
                .withCommonName("barganjiri.jpg")
               // .withImage("barganjiri.jpg")
                .withFamily("Aracea")
                .withIdentity("چندگونه از فیلودندرون با برگ های پهن و بریدگی های عمیق در گلفروشی ها موجود است که همه آنها تحت نام برگ انجیری به فروش می رسند ولی در گیاه شناسی که اساس طبقه بندی روی گل و دستگاه زایشی است ممکن است دو گیاه ظاهرا مشابه دو نام مختلف را به خود اختصاص دهند . ددر هر صورت آن گیاه با هر نامی که عرضه گردد در این نیازها مشترکتند.\n" +
                        "هوای گرم و مرطوب ایده آل آنهاست . تغییرات درجه حرارت را به راحتی می پذیرند ، ریشه های هوایی آنها احتیاج به تغذیه و تکیه گاه خزه دار دارند ، برای افراد مبتدی گیاهانی مناسب هستند")
                .withHerbals(
                        "نوک برگ ها قهوا ای رنگ می شوند: گیاه تشنه است ، فورا آبیاری کنید . همیشه خاک سطح گلدان را بازدید کنید به خصوص در تابستان که نیاز به آب بیشتری است.\n" +
                        "برگ ها رنگ پریده و سطح زیرین آنها  داری تار عنکبوت است : \n" +
                        "عامل آن کنه ریز قرمز است . گیاه را با سم کنه کش طبق دستور هر دو هفته یکبار سمپاشی کنید تا علایم برطرف گردند . غبارپاشی بخصوص زیر سطح برگ ها در کاهش آفت موثر است.\n" +
                        "برگ های زیرین زرد رنگ و سپس قهوه ای می گردند که شدت آن در زمستان بیشتر است:\n" +
                        "آبیاری بیش از اندازه عامل ان است . اجازه دهید سطح خاک گلدان در فاصله بین دو آبیاری کاملا خشک شود سپس آبیاری را با مفدار کمتری انجام دهید . هر دو هفته یکبار آبیاری کافی است.زهکش را بازدید کنید.\n" +
                        "رشد گیاه متوقف است : نور کافی نیست ، گلدان را به محل پر نور تری ممنتقل کنید.\n" +
                        "برگ ها بد شکل و شکافدار می شوند: گیاه را از محل پر تردد خارج کنید صدمات فیزیکی عامل آن است .\n" +
                        "لکه های سیاه و زخم مانند روی برگ هاست : هوا سرد است گیاه را به محل گرمتری منتقل کنید.\n" +
                        "بعضی از برگ ها شکاف طبیعی هم ندارند: گیاه از گونه دیگری است و عدم شکاف عمیق در برگ ها کاملا طبیعی است.\n" +
                        "لکه های قهوه ای در وسط یا حاشیه برگ ها نمایان شده است:\n" +
                        "در آفتاب غبارپاشی کرده اید . عبور نور از قطرات آفتاب به جای مانده روی برگ ها مانند عبور از شیشه است که به برگ ها صدمه وارد می آورد ، در سایه غبارپاشی کنید . برگ های صدمه دیده را بلا کارد تیز تا انتها قطع کنید .\n" +
                        "برگ ها رنگ پریده اند:\n" +
                        "احتیاج به تغذیه مصنوعی دارد. گیاه از کمبود عناصر در خاک رنج می برد هر سه هفته یکبار طبق دستور با کود مخصوص گیاه را تغذیه کنید.\n" +
                        "زخم های سفید پنبه ای شکل روی برگ ها مشاهده کی گردد :\n" +
                        "عامل آن حشره آفت است ، با سم حشره کش نفوذی هردو هفته یکبار گیاه را سم پاشی کنید.تا علایم برطرف گردد.\n" +
                        "برگ ها خشک و چروک دار هستند:\n" +
                        "گیاه تشنه و هوا خشک است .فورا آبیاری کنید .هر هفته دو یا سه بار غبارپاشی کنید.\n")
                .withSpecs(specs1)
                .withFavourite(true)
                .build();


        List<Spec> specs2 = new ArrayList<>();
        specs2.add(new Spec("نور",":به نور فراوان احتیاج دارد . اگرچه کمی نیم سایه را قبول می کند اما گیاه در آن ضعیف تر است . قلمه ها در نیم نور نیم سایه بهتر ریشه می دهند"));
        specs2.add(new Spec("دما","دمای بالاتر از 21 درجه نیازمند است .قلمه ها را باید گرم نگه داشت"));
        specs2.add(new Spec("آبیاری","آب در جریان را بهتر از آب انبار شده می پسندد . بین دو آبیاری کمی خاک را خشک کنید"));
        specs2.add(new Spec("رطوبت","نیاز به غبارپاشی ندارد"));
        specs2.add(new Spec("خاک","قلمه ها باید در ماسه شکری ، ماشی یا کمپوست بدون خاک کاشت گردند . گیاه بالغ احتیاج به خاک لوم دارد"));

        PlantEntity plant2 = new PlantEntity.Builder()
             .withName("شمعدانی")
//                .withNameRoot("")
                .withEnName("Geranium")
                .withSiName("pelargonium")
                .withCommonName("shamdoni.jpg")
                .withFamily("Geraniaceae")
    //            .withImage("barganjiri.jpg")
                .withIdentity("گیاهی  ملی است که همواره با گل لاله عباسی قبل از اینکه گل های دیگر وارد ایران شوند مورد نگهداری بوده است . آرایش این گل در لبه حوض خانه های قدیمی مشهور و خاطره انگیز است . این گیاه علاوه بر حوض خانه های قدیمی مشهور و خاطره انگیز است . امکان کاشت در باغچه ها در گلدان و در محیط های بسته نیز قابل نگهداری است . ازدیاد آن بسیار ساده و با قلمه صورت می گیرد ، واریته های بذری پر گل هم اکنون در ایران موجود است و در ایام عید و بهار به فروش می رشند")
//                .withHerbals("")
                .withSpecs(specs2)
                .withFavourite(false)
                .build();


        List<Spec> specs3 = new ArrayList<>();
        specs3.add(new Spec("نور","اتاقهای قسمت شمالی ساختمان بهترین شرایط نوری این گیاه را تامین می کند تحمل نور مستقیم آفتاب را ندارد."));
        specs3.add(new Spec("دما","بهترین درجه حرارت در زمستان 15 درجه سانتیگراد که قدرت تحمل 10 درجه را نیز دارد در تابستان درجه حرارت مطلوب 24 است. "));
        specs3.add(new Spec("آبیاری"," هفته ای دو بار آبیاری در تابستان برای گیاه کافی است ولی در زمستان به هفته ای یک بار کاهش می یابد زهکش گلدان باید مناسب باشد. "));
        specs3.add(new Spec("رطوبت","در تابستان هفته ای دو بار نیاز به غبار پاشی با آبفشان دارد. رطوبت اتاق در زمستان برای این گیاه آپارتمانی کافی به نظر می رسد."));
        specs3.add(new Spec("تغذیه","در فصل رشد در بهار و تابستان هر دو هفته یک بار تغذیه مصنوعی با کودهای قابل حل در آب مخصوص گیاهان زینتی لازم است"));
        specs3.add(new Spec("خاک مناسب","خاک برگ بهترین محیط رشد برای آن است."));
        specs3.add(new Spec("تعویض گلدان","به علت متراکم شدن ریشه ها و کم شدن جا برای رشد ریشه و سفت شدن خاک در بهار هر سال تعویض گلدان با یک درجه بزرگتر لازم است. "));
        specs3.add(new Spec("تمیز کردن برگها","پاک کردن برگها با پارچه نرم و یا اسفنج مرطوب کافی است. از مواد براق کننده شیمیایی که روزنه برگها را مسدود می کند خودداری کنید."));
        specs3.add(new Spec("ازدیاد","هر جوانه ای که در بهار از خاک خارج شده و دارای تعدادی ریشه است می تواند گیاه جدیدی را در گلدان دیگر برای شما تولید کند."));


        PlantEntity plant3 = new PlantEntity.Builder()
                .withName("آگلونما")
                .withEnName("Chinese evergreen")
                .withNameRoot("نخشید، نخ درخشان (نخ+شید = درخشان ) اشاره به معنی نام لاتین آن")
                .withCommonName("aglonama.jpg")
                .withIdentity(" گیاهی است از خانواده (آراسه ) به علت وضع برگها و انبوه بودن آنها در اتاقهای کوچک جلوه بیشتری دارد، ساقه ها کوتاه و برگهای بیرون آمده از غلاف نیزه ای شکل و خم شده به طرف پایین با طول 15-12 سانتیمتر مقاومت خوبی در برابر سایه و خشکی دارند، کاشت مخلوط این گیاه آپارتمانی با گیاهان متفاوت در داخل یک گلدان مقایسه جالبی در شکل برگها ایجاد خواهد کرد در برابر نور کم مقاومت خوبی دارد.")
                .withSpecs(specs3)
                .withFavourite(false)
                .build();

         /*   List<Spec> specs4 = new ArrayList<>();
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));
            specs4.add(new Spec("",""));

        PlantEntity plant4 = new PlantEntity.Builder()
                .withName("")
                .withEnName("")
                .withNameRoot("")
                .withIdentity("")
                .withSpecs(specs4)
                .withFavourite(false)
                .build();  */


        List<Spec> specs4 = new ArrayList<>();
        specs4.add(new Spec("نور","به نور کامل نیاز دارد، سایه به برگهای جدید صدمه جدی وارد می کند."));
        specs4.add(new Spec("دما","بهترین دما برای آن در پاییز تا بهار حدود 10 درجه و در بهار تا پاییز 16 درجه است."));
        specs4.add(new Spec("آبیاری","رای مرطوب نگهداشتن خاک در تابستان هفته ای 3 بار و در زمستان یک بار در هفته گیاه را آبیاری کنید. با مسن شدن گیاه و بزرگ شدن گلدان در تابستان به آبیاری روزانه نیاز دارد."));
        specs4.add(new Spec("رطوبت","غبار پاشی هفتگی در تابستان برای گیاه لازم است. بهتر است جهت حفظ رطوبت گیاه را به صورت گروهی با گیاهان دیگر کاشت گردد."));
        specs4.add(new Spec("خاک","مخلوطی از دو قسمت خاک لوم با یک قسمت خاک پوسیده شده با شن بهترین خاک زهکش دار برای این گیاه است."));
        specs4.add(new Spec("تعویض گلدان","هرساله در بهار تعویض گلدان برای گیاهان جوان لازم است با مسن شدن گیاه در سالهای پنجم به بعد گیاه را به گلدان یا گل جا با قطر 50 سانتی متر انتقال دهید اما هر سال به تعویض خاک رویی نیاز دارد"));
        specs4.add(new Spec("تمیز کردن برگها","غبارپاشی با آب بدون املاح برگها را تمیز می کند. از مواد شیمیایی استفاده نکنید. برگهای پیر را با اسفنج مرطوب تمیز کنید."));
        specs4.add(new Spec("آگاهی","تعویض گلدان های بزرگ و سنگین سخت است و اقدام به تعویض خاک رویی می گردد. حدود 5 سانتیمتر از خاک رویی را با وسیله ای تراشیده تا ریشه های گیاه آشکار گردد. به جای آن کمپوست غنی از مواد غذایی بریزید."));
        specs4.add(new Spec("دقت کنید","در کاشت گروهی گیاهان نیازهای نوری، رطوبتی و حرارتی گیاهان مختلف تقریبا باید متوازن و همسان باشند. "));

        PlantEntity plant4 = new PlantEntity.Builder()
                .withName("نخل بادبزنی")
                .withEnName("European fan palm")
                .withNameRoot("بابیزان = بادزن= اشاره به برگهای باد بزنی این نخل ها ")
                .withCommonName("nakhlebadbezani.jpg")
                .withIdentity("این گونه نخل زینتی بومی اروپا و نام انگلیسی آن هم مشتق از همین است. از گونه چینی C.chinensis بسیار ظریف تر است. بهترین نخل برای اتاقها و سرسراهای سرد است ارتفاع آن در خارج از اتاق به 6 متر با برگهایی به طول 60 سانتی متر می رسد اما در محیط بسته بلندی آن از 2/1 متر تجاوز نمی کند. برگهای زیبایی بادبزنی آن جهت تزیین به کار می رود رشد خود را با یک برگ بدون ساقه شروع می کند و با خروج برگهای بعدی اولین برگ خشک می شود و دمبرگ های قطع شده ساقه ای زیبا می سازند.")
                .withSpecs(specs4)
                .withFavourite(false)
                .build();


        List<Spec> specs5 = new ArrayList<>();
        specs4.add(new Spec("نور","اگر چه برای تشکیل رنگ عامل تعیین کننده است اما در صورت شدید بودن از بین برنده آن هم نیز هست. نور مستقیم و شدید را دوست ندارد. ضلع شمالی خانه ها را بهتر از ضلع جنوبی آن می پسندد."));
        specs4.add(new Spec("دما","بهترین آن حدود 31 درجه است . اگر آبیاری خوب باشد بالای 38 درجه هم تحمل می کند. درجه حرارت زیر 10 رنگها را ممکن است از بین ببرد. به نظر می رید بین حرارت و رطوبت و نور در این گیاه رابطه ای موجود باشد و بر روی همدیگر تاثیر متقابل داشته باشند."));
        specs4.add(new Spec("آبیاری","تشکیلات ریشه ای در این گیاه به گونه ای است که خاک باید همیشه مرطوب باشد و در روزهای داغ تابستانی شاید هر روز به آب نیاز داشته باشد در زمستان یک دوره استراحت نیز دارد که آبیاری هفتگی است."));
        specs4.add(new Spec("رطوبت","غبارپاشی دو بار در هفته برای آن پیشنهاد می گردد در داخل زیر گلدانی سنگریزه و آب بریزید اما مواظب باشید انتهای گلدان با آب تماس نداشته باشد."));
        specs4.add(new Spec("پس از گلدهی","گلهای حسن یوسف جذاب و مورد نظر پرورش دهندگان نیست و باید به محض مشاهده حذف شوند. اصولاً هنگامی که تعداد برگها به 5-4 رسید جوانه انتهایی را حذف می کنند تا گیاه حالت چنبره ای به خود بگیرد. حسن یوسف یکساله است و معمولاً در آخر پاییز گیاه را خواهان نیستند و در سال آینده از گیاه جدید استفاده می کنند. اما می تواند زمستان گذرانی کند و در بهار زندگی جدیدی داشته باشد. در این صورت آبیاری را کاهش دهید و در درجه 12 در نقطه ای نورانی قرار دهید."));
        specs4.add(new Spec("تغذیه","در فصل رشد کود ازت دار برای توسعه اندام برگی و ساقه ای خود نیاز دارد هر 10 روز یک بار تغذیه شود."));
        specs4.add(new Spec("خاک","خاک لوم و کمپوست بدون خاک از خواسته های آن است گیاهانی که ریشه های گسترده ای دارند گلدانهای با قاعده پهن تر بهتر می پسندند. "));
        specs4.add(new Spec("ازدیاد با بذر","بستری از کمپوست در سینی کاشت فراهم کرده و بذرها را در بهار کاشت کرده و لایه ای بسیار نازک از پودر کمپوست روی آنها بپاشید آبیاری از زیر انجام شود و در درجه 21 و نور کافی قرار داده روی آن کیسه پلاستیکی بکشید هنگامی که نشانه ها به 5 سانتیمتر رسیدند آنها را جدا و در گلدان جدید کاشت کنید. \n" +
                "در نقاط رشد حشرات کوچکی مشاهده می شوند: شته سبز ایت گیاه را با سم نفوذی طبق دستور سمپاشی کنید در صورت لزوم یک هفته بعد تکرار شود. \n" +
                "حاشیه برگها زرد شده و به طرف داخل می پیچند : لارو حشره است که به ریشه حمله کرده است علاجی ندارد گیاه تلف خواهد شد. "));
        specs4.add(new Spec("در نقاط رشد حشرات کوچکی مشاهده می شوند","گیاه در معرض نور مستقیم قرارداده شده است آن را به نقطه ای امن تر ببرید."));

        PlantEntity plant5 = new PlantEntity.Builder()
                .withName("حسن یوسف")
                .withEnName("Flame nettle")
                .withNameRoot("نیام فَل ، نیام = کاسبرگ+ فَل = برگ، اشاره به معنی یونانی آن نیامبرگ که اشاره به یک دسته پرچم بدون گیاه دارد. ")
                .withIdentity("گیاهی مشهور در خانواده های ایرانی. به خاطر ازدیاد ساده آن کمتر کسی است که به این گل دسترسی داشته اما قلمه ای از آن نگرفته باشد. واریته های جدید از طریق بذر ازدیاد می یابند اما گونه ای که در خانه ها فراوان یافت می شود از طریق قلمه گیری به راحتی زیاد می شوند. برگها رنگین و آتشین هستند و نام انگلیسی آن هم برگرفته از همین است. برای رنگ گرفتن برگها نور خاصی لازم است، درجه و شدت نور در توسعه رنگها خیلی مهم است. اگر جوانه انتهایی گیاه حذف شود شاخه های جانبی شروع به رشد کرده و گیاه چلچراغی و توپی می شود که برای سبد آویز مناسب است. برای این منظور به محض اینکه شاخه ها دارای 5 جفت برگ شدند جوانه انتهایی را حذف کنید.")
                .withCommonName("hosneyousef.jpg")
                .withSpecs(specs5)
                .withFavourite(false)
                .build();

        List<Spec> specs6 = new ArrayList<>();
        specs4.add(new Spec("نور","شدیدترین نورها حتی در آفتاب ظهر گاهی را دوست دارد. در گلخانه احتیاج به ایجاد سایه ندارد پشت پنجره های نورانی قرار دهید."));
        specs4.add(new Spec("دما","گلدان را درجه حرارت بالاتر از 4 درجه در زمستان و زیر 38 درجه در تابستان نگه دارید. گیاه قادر به ادامه حیات در گرم ترین هوا را دارد اما جریان هوا به منظور اکسیژن رسانی باید برقرار باشد."));
        specs4.add(new Spec("آبیاری","به هیچ عنوان آبیاری زیاده از حد نباشد. محل زندگی این گیاه در طبیعت وحشی فاقد بارندگی است در زمستان آنرا کاملاً خشک و فقط در اواخر بهار آبیاری را شروع کنید و در طول فصل رشد یعنی تا اواخر تابستان برنامه را بر دو هفته یک بار بگذارید در اوایل پاییز آبیاری را قطع کنیدمواظب باشید خاک در فاصله بین دو آبیاری را قطع کنید مواظب باشید خاک در فاصله بین دو آبیاری خشک شود سپس آبیاری کنید آزمایش رطوبت خاک در فاصله بین دو آبیاری با دست فراموش نشود ."));
        specs4.add(new Spec("تغذیه","در فصلهای رشد بهار و تابستان هر ماه یک بار با کود قوی پتاسه گلدان خود را تغذیه کنید"));
        specs4.add(new Spec("خاک","یک قسمت کمپوست بدون خاک یا کم خاک دو قسمت ماسه شکری ماشی نخودی خاک بسیار خوبی است. زهکشدر این کاکتوس با بالا بردن درصد ماسه تقویت شده است. "));
        specs4.add(new Spec("تعویض گلدان","هر ساله گلدان را با یک درجه بزرگتر تعویض کنید تا قطر آن به 13 سانتیمتر برسد و سالهای بعد با گلدان سابق جابجا گردد بازدید ریشه ها جهت بزرگتر کردن گلدان لازم است."));
        specs4.add(new Spec("دیگر گونه ها","گونه های زیادتری از این جنس وجود دارد اما به علت حساسیت شدید به ابیاری زیاده از حد نمی توانند در محیط های مرطوب زندگی کنند و ریشه آنها به فساد مبتلا می گردد بلوغ دیر رس آنها نیز در انتخاب آنها به عنوان گیاه خانگی علت دیگر عدم استقبال است. \n" +
                "کاکتوس Copiapoa haseltoniana پس از چندسال یا گیاه هایی از کنار خود به بیرون می فرستد که خارهای زرد کرمی آن با رنگ سبز زیتونی ساقه زیبایی خاصی به آن می بخشد . گلها به این سادگی و به این زودی ظاهر نمی شوند و گیاه احتیاج شدیدی به نقطه ای نورانی دارد. \n" +
                "رشد Copiapoa calderana خیلی کند و ظهور گلهای آن هنگامی است که ارتفاع گیاه به حدود 5 سانتیمتر می رسد از نشانه ظهور گل ایجاد لایه ای از الیاف سفید پشم مانند در نقطه رشد انتهایی است. \n" +
                "آبیاری : هرگز کاکتوس Copiapoas را زیاده از حد آبیاری نکنید این کاکتوس در طبیعت در شرایط بسیار خشک زندگی می کند همیشه رطوبت خاک را قبل از آبیاری با انگشتان لمس کنید و مطمئن شوید که خاک به اندازه کافی خشک است سپس آبیاری کنید. \n" +
                "تغذیه : کاکتوس ها علاقه وافری به عنصرپتاس در کودها دارند چون گوجه فرنگی نیز همین عادت را نشان می دهد اصولاً از فروشنده کود گوجه فرنگی تقاضا می کنند. مواظب باشید محلول کود که در حقیقت نمکی است روی بافت ظریف کاکتوس پاشیده نشود. در صورت اتفاق با برس نرم لکه ها را بشویید هرماه یک بار گیاه را تغذیه کنید."));
        specs4.add(new Spec("نکته","حذف اندام فاسد در گوشتی ها و کاکتوس ها زمانی موفقیت آمیز است که محل قطع عضو فاسد با محلول یا پودر قارچ کش قوی ضد عفونی شود."));
        specs4.add(new Spec("رشد Copiapoa Montana","چنان کند است که در هر سال فقط نیم سانتیمتر به ارتفاع آن افزوده می گردد ارتفاع نهایی آن به حدود 10 سانتیمتر می رسد زمانی که ارتفاع گیاه به 5 سانتیمتر رسید حدود 6-5 گل زیبای زرد رنگ ظرف یک هفته در تابستان به ظهور می رساند خارها بسیار زیبا و سیاه رنگ هستند و تارهای سفید پشم آلود در نقطه رشد انتهایی به زیبایی آنها می افزاید. \n" +
                "اکثر گونه های Copiapoa دارای ریشه های غده ای هستند مواظب باشید در هنگام تعویض گلدان به آنها صدمه وارد نگردد."));

        PlantEntity plant6 = new PlantEntity.Builder()
                .withName("کوپیاپوآ")
                .withEnName("Copiapoa")
                .withNameRoot("ریشه لغوی آن پیدا نشد")
                .withIdentity("این کاکتوس متعلق به مناطق کویری شیلی است که بارندگی در آن تقریبا صفر است نیاز آبی گیاه فقط از طریق رطوبت هوا امکان پذیر است که به صورت قطرات میکروسکوپی روی خارها و خاک اطراف گیاه جذب می گردد. گونه C.cinerea از بلند قامت ترین آنها با 130 سانتیمتر ارتفاع در طبیعت است که تا ظهور گلها و بلوغ 20 سال طول می کشد گونه هایی با ارتفاع و زمان بلوغ کمتر در بازار گل جهانی موجود است.")
                .withCommonName("copiapua.jpg")
                .withSpecs(specs6)
                .withFavourite(false)
                .build();

        List<Spec> specs7 = new ArrayList<>();
        specs4.add(new Spec("نور","به نور شدید احتیاج دارد ولی اشعه مستقیم آفتاب در ظهر به گیاه صدمه وارد می کند."));
        specs4.add(new Spec("دما"," حداقل درجه حرارت برای این گیاه 12 و حداکثر 35 درجه سانتیگراد است."));
        specs4.add(new Spec("آبیاری","در کلیه فصلها احتیاج به آبیاری فراوان دارد بطوری که گلدان همیشه باید حالات باتلاقی پیدا کند."));
        specs4.add(new Spec("رطوبت","غبارپاشی در تابستان باید روزانه انجام شود ولی در زمستان هفته ای یک بار کافی است."));
        specs4.add(new Spec("تغذیه"," گیاهی کم توقع است ولی در صورت لزوم میتوان از کودهای مخصوص گیاهان زینتی طبق دستور هر دو هفته یکبار استفاده کرد."));
        specs4.add(new Spec("خاک مناسب","خاک باید کمی سنگین و رس آن زیادتر از خاک برگ باشد تا رطوبت را در خود حفظ کند."));
        specs4.add(new Spec("تعویض گلدان","هر سال در فصل بهار عمل تعویض گلدان و تقسیم ریشه ها و تولید گلدانهای بیشتر انجام می گردد."));
        specs4.add(new Spec(" تمیز کردن برگها","غبار پاشی جهت تمیز شدن برگها کافی است از مواد براق کننده استفاده نکنید."));
        specs4.add(new Spec("ازدیاد","تقسیم بوته در بهار کاشت بذر در عمق کم خاک سبک کاشت چتر بصورت وارونه.  "));

        PlantEntity plant7 = new PlantEntity.Builder()
                .withName("نخل مرداب")
                .withEnName("Umberlla grass")
                .withNameRoot("چترگیاه (برگرفته شده از شکل گیاه که چتر مانند است )")
                .withIdentity("گیاهی است زیبا و ارزان نگهداری آن ساده با قابلیت ازدیاد فراوان همه برگها از سطح خاک می رویند و منظره زیبایی چتری به گیاه می دهند، در مناطق گرمسیر در محیط های  باز خارج از منزل پرورش می یابد ارتفاع آن به حدود 150 سانتیمتر می رسد به اب فراروان احتیاج دارد و به همین علت نخل مرداب نام گرفته است خاک را عمداً سنگین انتخاب می گردد و به زهکس توجه چندانی نمی شود تا خاک گلدان کمی با تلاقی گردد زادگاه آن جزایر ماداگاسکا و خانواده آن سیپراسه است.")
                .withCommonName("umberlla.jpg")
                .withSpecs(specs7)
                .withFavourite(false)
                .build();

        List<Spec> specs8 = new ArrayList<>();
        specs4.add(new Spec("نور","به نقطه ای نورانی نیاز دارند خصوصا در زمستان و بهار هنگامی که گلها در درون گیاه شکل می گیرند."));
        specs4.add(new Spec("دما"," فقط مقدار کمی از آنها درجه حداقل 4 را ترجیح می دهند . اما بهترین درجه زمستانه برای آنها ۷ و در تابستان زیر ۳۸ را خواهان هستند اکسیژن فراوان در یک باید جریان دار فراموش نشود"));
        specs4.add(new Spec("آبیاری","در بهار و تابستان آبیاری را به صورت هفتگی و در گلدان های با قطر ۱۳ سانتی متر و بیشتر هر دو هفته یکبار در پاییز ماهیانه و در زمستان قطع کنید"));
        specs4.add(new Spec("تغذیه","از کودهای پتاسه قوی در بهار و تابستان ماهیانه استفاده کنید ."));
        specs4.add(new Spec("خاک","یک قسمت ماسه شکری تا نخودی و ۲ قسمت کمپوست کرم خاکی دنیا بدون خاک بستر خوبی برای این کاکتوس است."));
        specs4.add(new Spec(" تعویض گلدان","هر سال در اوایل سال گلدان را با یک درجه بزرگتر تعویض کنید که قطر گلدان به ۱۳ سانتی متر برسد سالهای بعد فقط با تکان دادن ریشه نسبت به تعویض خاک های ریخته شده اقدام کنید ۲ سانتی متر از خاک روی را با کمپوست نور تعویض کنید گلدان را تغییر ندهید مگر اینکه حجم ریشه اندازه بزرگتر را خواهان باشد از گلدان های سیمی مانند و نیلگون آنها برای آنهایی که ریشه های سطحی دارند و گلدان های عمیق تر برای ریشه های غده ای و حجم دار استفاده کنید."));
        specs4.add(new Spec(" دیگر گونه","نام بردن از گونه\u200Cها در این حجم از کتاب امکان ندارد اما توجه داشته باشید که انتخاب گونه های آن بر اساس سلیقه نگهداری کنندگان و علاقه آنها به خار یا گل یا هردو است بارها از قلابی ضخیم و سوزن لحاف دوزی تا ظریف و موی متغیر است طیفی از کل رنگ های موجود در کاکتوس ها در اینگونه یافت می گردد."));
        specs4.add(new Spec("آگاهی","درجه حرارت خیلی سرد و میزان رطوبت گلدان رابطه مستقیمی دارد هرچه در حرارت پایین تر میزان رطوبت باید کمتر باشد به گونه\u200Cای که آبیاری در گلدان های خارج از اتاق در زمستان متوقف می گردد."));
        specs4.add(new Spec(" نکته عمومی"," گیاهانی که نیاز آبی آنها با بقیه تفاوت چشمگیر دارد به صورت گروهی کار نکنید در صورت تمایل گیاه را با گل دانه درون گل دانه بزرگ قرار دهید تا آبیاری آن به صورت مجزا عملی گردد.\n" +
                " گونه mammillaria zeilmaniana هنگامی در بهار و تابستان گل ها به ظهور می\u200Cرسند که گیاه به ارتفاعی حدود 3-4سانتی متر رسیده باشد گل ها در یک دوره گلدهی یک ماهه نمایان می شود و هر کدام از آنها تقریبا یک هفته روی گیاه باقی می\u200Cمانند پا گیاه ها در گیاه3-2 سال شروع به نمایان شدن می\u200Cکنند و این در حالی است که هر کدام از آنها در بهار و تابستان همزمان با گلدهی، گیاه خود نیز گل می دهند از آنها به عنوان منبع زیاد استفاده می\u200Cگردد کل ارتفاع گیاه در گلدان ۶ سانتی متر و پهنای آن3-4 سانتی متر است ."));

        PlantEntity plant8 = new PlantEntity.Builder()
                .withName("مامی لاریا")
                .withEnName("powder puff cactus")
                .withNameRoot("پستانه، از واژه نوک پستان برگرفته شده است که اشاره به ژوخک های روی گیاه ارد.")
                .withIdentity("زادگاه اصلی آن صحراهای مکزیک است. بعضی از گونه ها در نواحی کوهستانی نیز بافت می ردند. بیش از 200 گونه با اندازه ها متفاوت از بند انگشت تا کپه هایی با 3 متر پهنا می توان دید. گلها به صورت انفرادی به صورت حلقه ای دور مرکز رشد انتهایی ظاهر می شوند رنگ آنها سفید، زرد، صورتی قرمز و بنفش و رنگهای بینابینی است. خارها به صورت حلقه های مارپیچ که در بعضی سوزن مانند و بسیار تیز و کلفت و دیگر گونه های نرم و تنعطاف پذیر روی ساقه وجود دارند. رنگ این خارهای از سفید تا سیاه و قرمز و قهوه ای متغیر است.")
                .withCommonName("mamilaria.jpg")
                .withSpecs(specs8)
                .withFavourite(false)
                .build();

        List<Spec> specs9 = new ArrayList<>();
        specs4.add(new Spec("نور"," به نور کافی و تقریبا آفتابی احتیاج دارد ولی نور آفتاب ظهر به گیاه صدمه وارد می کند اگر محیط دارای نور کافی نیست هر چند وقت یکبار به محل پرنورتر انتقال دهید در غیر اینصورت برگ\u200Cها سبزی و شاداب بودن خود را از دست میدهند."));
        specs4.add(new Spec("دما","حداقل درجه حرارت در زمستان ۱۰ درجه سانتیگراد است که در صورت نوزادان باید آبیاری متوقف گردد در تابستان درجه حرارت طبیعی اتاق برای آن مطلوب است و در صورت بالا بودن آن نیاز به  غبارپاشی دارد."));
        specs4.add(new Spec("آبیاری","در تابستان3-2 بار در هر هفته و در زمستان هر ۱۰ روز یکبار با آب ولرم آبیاری کنید آب روی سطح برگها و قاعده آنها نریزن چون باعث پوسیدگی می گردد."));
        specs4.add(new Spec("رطوبت","در تابستان هفته ای یک بار و در زمستان هر دو هفته یکبار غبارپاشی لازم است اضافه کردن آب به زیر گلدانی سنگریزه دار بدون ایجاد تماس گلدان با آب در ایجاد رطوبت پایدار کمک می کند."));
        specs4.add(new Spec("تغذیه","کمبود عناصر خاک گلدان را با اضافه کردن کود شیمیایی مخصوص گیاهان زینتی هر ۲۰ روز یکبار به دستور جبران کنید."));
        specs4.add(new Spec(" خاک مناسب","لیمونی و کمپوست پیت به نسبت ۴ بر ۱"));
        specs4.add(new Spec("تعویض گلدان","هر یک سال و یا هر سال و نیم یک بار گیاه احتیاج به تعویض گلدان دارد ترجیح می\u200Cدهد در گلدان کوچکتر زندگی کند."));
        specs4.add(new Spec("ازدیاد","جدا کردن پاگیاه در بهار و ریشه دار کردن آن ها هر پاگیاه در یک گلدان کاشت گردد.\n" +
                "پاندانوس\n" +
                " ساقه ضخیم و کوتاه پاندانوس برروی انبوهی از ریشه\u200Cهای را پیچیده می گویند که و برگهای ضخیم خلافی و قایق مانند آن به طرف پایین متمایل می گردند گیاه را باید روی پایه یا محل بلند و به دور از محل رفت و آمد قرارداد.\n" +
                " تمیز کردن برگها: از مواد براق کننده شیمیایی می توانید هر سه هفته یک بار استفاده کنید بهتر از برگ ها را با پارچه نرم و اسفنج مرطوب تمیز کنیم."));
        specs4.add(new Spec(" نکته عمومی","گیاهانی که به علت استراحت زمستانه دام هوایی خود را از دست دادند تغذیه مصنوعی نکنید تعویض گلدان: متراکم شدن ریشه ها و کم شدن رشد در بهار علامت تعویض گلدان است:\n" +
                " الف :گلدان را قبل از تعویض آبیاری و مطابق شکل گیاه را خارج کنیم.\n" +
                " ب: خاک های کهنه را به ملایمت کنار بزنید گیاه را در وسط گلدان جدید قرار دهید و خاک جدید اضافه کنید.\n"));

        PlantEntity plant9 = new PlantEntity.Builder()
                .withName("پاندانوس")
                .withEnName("screw pine")
                .withNameRoot("ریشه لغوی آن پیدا نشد.")
                .withIdentity("زیبایی خاص این گیاه زینتی روییدن برگ ها در طول محور ساقه است که در صورت قرار دادن آن روی پایه و یا در محل بلند نظرها را به خود جلب می کند در کلیه  منازل با شرایط آپارتمان خود را سازگار نشان داده است و کار کشیده و بلند سبز و دارای خطوط سفید و کرمی و زرد رنگ ، در سرتاسر حاشیه برگها از قاعده تا نور که مملو از دانه های ظریف و خار مانند است با زیاد شدن زندگی ها احتیاج به جا و مکان بیشتری دارد در محل اتصال برگ با ساقه جوان\u200Cهایی با ریشه های کوچک می\u200Cرویند که قابل انتقال به گلدان دیگری هستند انتخاب نام انگلیسی screw( پیچ )برای آن با علت درد گرفتن ساق توسط برگ ها به صورت مارپیچ است خانواده آن پاندا مناسب و متعلق به مناطق گرم است .")
                .withCommonName("pandanos.jpg")
                .withSpecs(specs9)
                .withFavourite(false)
                .build();

        List<Spec> specs10 = new ArrayList<>();
        specs4.add(new Spec("نور",""));
        specs4.add(new Spec("ماه",""));
        specs4.add(new Spec("آبیاری",""));
        specs4.add(new Spec("رطوبت",""));
        specs4.add(new Spec("تغذیه",""));
        specs4.add(new Spec("تعویض گلدان",""));
        specs4.add(new Spec("نکته عمومی",""));
        specs4.add(new Spec("عوارض و درمان",""));
        specs4.add(new Spec(" برگها رنگ پریده و سطح زیرین آن ها مملو از تار عنکبوت است",""));

        PlantEntity plant10 = new PlantEntity.Builder()
                .withName("روئلیا")
                .withEnName("trailing velvet plant")
                .withNameRoot("تیرازین (تیراژه= رنگین کمان+ یا نسبت) اشاره به رنگارنگ بودن گلها")
                .withIdentity("گیاهی از خانوادهآکانتاسه و زادگاه آن برزیل ساقه\u200Cها علمی و گسترده و پراکنده و مناسب برای سبد آویزان بعدها بیضی شکل به رنگ سبز زیتونی با بافت و شیره بنفش رگبرگها سبز رنگ و زیبا و کاملا نمایان گلها در ویراست های مختلف متفاوت و به رنگ زرد و قرمز سفید و ارغوانی و بنفش گل ها پر دوام و عمر آنها در تابستان تا اواسط زمستان نام انگلیسی آن برگرفته شده از نامruellia گیاه شناس فرانسوی در قرن شانزدهم  است.")
                .withCommonName("roulia.jpg")
                .withSpecs(specs10)
                .withFavourite(false)
                .build();

        List<Spec> specs11 = new ArrayList<>();
        specs4.add(new Spec("نور","به نور دائم در روز احتیاج ندارد هر روز3-4 ساعت نور برای آن کافی است پشت پنجره هایی که با کاغذ آن را مارک کرده باشند می پسندند در روزهای با آفتاب قوی در گلخانه برای آن سایه درست کنید نور مستقیم آفتاب را به طور کلی نمی\u200Cپسندد."));
        specs4.add(new Spec("دما","حداقل حرارت برای آن ۴ درجه است در روزهای تابستان جریان هوای اکسیژن دار فراموش نشود. آبیاری: در بهار و تابستان هر دو هفته یکبار آبیاری کنید در ماه های داغ به هفته یکبار برسانید . فاصله بین دو آبیاری خاک را خشک و در پاییز باز هم آبیاری کمتر و در زمستان آن را قطع کنید."));
        specs4.add(new Spec("تغذیه"," 2-3بار در تابستان از کودهای پتاسه قوی برای تغذیه استفاده کنید."));
        specs4.add(new Spec("خاک","مخلوطی از ۳۰ درصد ماسه شکری تا نخودی بهترین خاک را تشکیل می\u200Cدهد."));
        specs4.add(new Spec("تعویض گلدان","هر بهار گلدان را با یک درجه بزرگتر تعویض کنید توجه کنید که این گونه دارای ریشه های سطحی است و نیم گلدان و یا گلدان های پر و کم آب را دوست دارد دو هفته اول پس از تعویض آبیاری نکنید."));
        specs4.add(new Spec("ازیاد","شاخه های رشد کرده در اطراف گیاه اصلی و یا حتی یک برگ  می\u200Cتواند به عنوان منبع اصلی از زیاد باشد با کارد تیز و با احتیاط آن را از خاک جدا و با فرمون در محل قتل یا زخم ها پاک پاشی کنید دو روز اجازه دهید خشک شود سپس در کمپوست خشک کاشت و بعد از سه هفته تا ظهور ریشه\u200Cها آبیاری کنید. بدانید: شته\u200Cها برای مکیدن شیره گیاهی با خرطوم خود احتیاج به بافت ظریف گل دارند گیاهان گوشتی گلدار باید همیشه مورد بازدید قرار گیرند."));
        specs4.add(new Spec("در قاعده و انتهای برگ ها از اجسام سفید پنبه ای دیده می\u200Cشود","شپشک آردآلود عامل آن است گیاه را با سمبل نفوذی ضعیف را با غلظت پایین سمپاشی کنید با پنبه آغشته به همین سبب لکه ها را مسموم کنیم تا لار های زیر اجسام پنبه ای شکل از بین بروند و در فصل رشد می\u200Cتواند2-3 بار سمپاشی تکرار شود."));
        specs4.add(new Spec("حشرات سبز رنگ روی گلها و ساقه گل دهنده دیده می شوند","شته سبز است با یک سم نفوذی گیاه را سمپاشی کنید در صورت لزوم 10 روز دیگر تکرار شود . شته ها با خرطوم خود شیره گیاه را می مکند از همین نظر است که سم باید نفوذی باشد تا شیره گیاهی را مسموم کند.\n" +
                "رشد گیاه در بهار و تابستان به کندی صورت می گیرد: ریشه ها در اثر آبیاری خارج از اندازه از بین رفته و با خاک خیلی سنگین و فشرده و با نفوذ پذیری خیلی کم است اگر ریشه پوسیده باشد آنرا خارج کرده و قسمت های از بین رفته را حذف و به هورمون رشد آغشته کنید. خاک جدید شامل کمپوست با 30 درصد ماسه شکری ماشی باشد."));
        specs4.add(new Spec("برگها بی قاعده دراز می شوند رنگ پریده هستند:\n","نور کافی نیست، در زمستان به نور فراوان و در تابستان به 4-3ساعت در روز نور روشن ولی ملایم نیاز دارد در تابستان در هنگام انتقال به نور باید گام به گام برای دو هفته اول آن را به نور برد یا اینکه در زمستان هوا خیلی گرم و خاک گلدان مرطوب است درجه حرارت را حدود ۱۰ نگهداری خاک را خشک کنید."));

        PlantEntity plant11 = new PlantEntity.Builder()
                .withName("هاورتیا")
                .withEnName("Haworthia")
                .withNameRoot("هاورتیا برگرفته شده از نامHaworth گیاه شناس انگلیسی")
                .withIdentity("یکی از عمومی ترین گوشتی ها جنس هاورتیا است که اکثر گوشتی داران آن را پرورش می دهند برگ ها به صورت کپی از سطح خاک خارج می شود و منظره زیبایی به گلدان می دهند دارای نوارهای سفید در برگها است ارتفاع آن به ۱۰ سانتی متر می رسد 30- ۲۰ سانتی متر پهنا دارد و بیش از ۱۰۰ گونه از آن در گلخانه ها کاشت می گردد از گونه\u200Cهای مهم H.retusa, H.limifolia, H.nigra, H.viscosa")
                .withCommonName("havertia.jpg")
                .withSpecs(specs11)
                .withFavourite(false)
                .build();

        List<Spec> specs12 = new ArrayList<>();
        specs4.add(new Spec("نور","۸ هفته اول بعد از کاشت در تاریکی مطلق سپس در نور کم نور کامل تا رنگ سبز روشن گرفتن اندام هوایی و از آن پس نور فراوان تا آخر دوره گلدهی مواظب اشعه مستقیم باشید."));
        specs4.add(new Spec("دما","هنگامی که در تاریکی از حرارت هفت درجه و سپس تا آخر دوره گلدهی بین ۱۶-۱۸ درجه در دوران گلدهی هر چه هوا خنک تر باشد عمر گل بیشتر است."));
        specs4.add(new Spec("آبیاری","پیاز را در کمپوست مرطوب کاشت کنید. تا هنگامی که در تاریکی از هر هفته میزان رطوبت را بازدید کنید در دوران گلدهی 2-3 بار آبیاری در هفته لازم است."));
        specs4.add(new Spec("رطوبت","هیچ نیازی به نقاشی ندارد هوای خنک و خشک است خواسته های آن است."));
        specs4.add(new Spec("تغذیه","اگر پیاز را برای کاشت در سال دوم در باغچه نیاز دارید با مشاهده اولین غنچه تغذیه را به صورت هفتگی با کودهای مایع مخصوص گیاهان خانگی شروع کرده و تا باز شدن غنچه ها ادامه دهید تربیت هنگامی که کاملا گل ها باز شده باشد تغذیه نکنید ."));
        specs4.add(new Spec("خاک","برای کاشت در کدام از فیلم های مخصوص کاشت پیاز استفاده کنید کمپوست بدون خاک هم مناسب است."));
        specs4.add(new Spec("پس از گلدهی","پس از تمام شدن عمر گل ساقه گل دهنده را قطع و در باغچه کاشت کنید.\n" +
                "  بلندی سنبل  حدود ۲۵ سانتیمتر میرسد هر پیاز فقط دارای یک ساقه گل دهنده خواهد بود که هرکدام 20-30گلچه رنگی شکل آب جان با رنگ های قرمز صورتی آبی زرد و یا سفید هستند هرگل 6-4 هفته روی گیاه باقی می\u200Cماند هر چه سرما بیشتر باشد عمر گل بیشتر خواهد بود همیشه از واریته های کاشت در گلدان استفاده کند."));
        specs4.add(new Spec("هنگامی که گل ها کاملا باز شده است ساقه گل دهنده به طرف خارج خم میشود:","نور کافی نیست پیاز را در نور کامل قرار دهید از آفتاب مستقیم در امان نگه دارید قبل از گلدهی گیم مناسب برای آن تهیه کنید"));
        specs4.add(new Spec("برگ های زرد شده و رشد متوقف است:","بیماری زردی سنبل نام دارد علاج ندارد پیاز تلف خواهد شد همیشه پیاز را قبل از خرید بازدید و از نظر ظاهر از سالم بودن آن مطمئن شویم از فروشگاه های معتبر خرید کنید"));

        PlantEntity plant12 = new PlantEntity.Builder()
                .withName("سنبل")
                .withEnName("Hyacinth")
                .withNameRoot("ریشه لغوی آن پیدا نشد.")
                .withIdentity("یکی از زیباترین گل ایام نوروز است که اگر نگهداری کنندگان گلهای خانگی چند اصل مهم را در پرورش این گل دوست داشتنی بدانند می\u200Cتوان از سنبل سفره هفت سین خود را پرورش دهند او لذت ببرند اول اینکه پیاز 8 هفته سرمای شدید و تاریکی مطلق می خواهد تا سیستم ریشه ای خود را شکل دست دوم تا قبل از این که جوانه گل ظاهر نشده باشد هیچگونه حرارتی نباید ببیند سوم اینکه هنگامی که به گلدهی کامل فیل نیاز آبی آن بسیار بالا است ریاض را داخل گلدان ۹ سانتی\u200Cمتر ای کاشت کرده روی آن ماسه بریزید و در محلی خیلی سرد قرار دهیم تا ۹۰  کردن پیاز و غنچه گل کامل نمایان شود از این پس و مانور دادن فرا می\u200Cرسد در این هنگام گلدان را تعویض کرده و در روز ۱۵ سانتی متری کاشت کنید از این به بعد دوره کامل مورد نیاز آن است تا عمر گل به پایان برسد پیازهایی با این طرز کاشت برای سال آینده گل نخواهند داد.")
                .withCommonName("sonbol.jpg")
                .withSpecs(specs12)
                .withFavourite(false)
                .build();

        List<Spec> specs13 = new ArrayList<>();
        specs4.add(new Spec("نور","از نور مستقیم بیزار است  اما بین سایه و نور باید نور متمایل به سایه را انتخاب کرد.نور از سایه بیشتر باشد زیرا برای رنگ سبزتیره گرفتن برگ های نو احتیاج به نور است . اما در هر حال سایه را بهتر می پسندد."));
        specs4.add(new Spec("دما","حداقل آن در زمستان 10 درجه و در تابستان به طور میانگین 12-15 درجه است . اگر دما بالا باشد برگها خود را می اندازند . جریان هوا را دوست دارد."));
        specs4.add(new Spec("آبیاری",""));
        specs4.add(new Spec("رطوبت",""));
        specs4.add(new Spec("تغذیه",""));
        specs4.add(new Spec("خاک",""));
        specs4.add(new Spec("تعویض گلدان",""));
        specs4.add(new Spec("پاک کردن برگ ها",""));
        specs4.add(new Spec("در زیر برگ ها تارهایی مشاهده می گردد",""));

        PlantEntity plant13 = new PlantEntity.Builder()
                .withName("شویدی  ، نرمه")
                .withEnName("Plume asparagus")
                .withNameRoot("مارچوبه ( اشاره به ساقه های زیر زمینی و خوراکی آن و شباهت آن به مار)")
                .withIdentity("زیبایی گیاه همیشه فقط مربوط به اندام گیاهی آن نیست. بلکه بیننده دایما در حال مقایسه است .ریز و درشت ، ظریف و خشن ، بزرگ و کوچک ، سیاه و سفید . برگ پهن و برگ باریکو صدها صفت دیگر.ظرافت برگ های ریز و سبز آن مورد مقایسه با برگ های دیگر قرار می گیرد. در هنگام خرید ارتفاع آن حدود 30 سانتیمتر است  اما بعد از 3-4 سال ارتفاعی در حدود 90 سانتی متر به خود می گیرد . اگر گلدان آن تعویض نگردد و یا گیاه تقسیم نشود ریشه ها به صورت غده از سطح خاک بیرون رانده می شوند .\n" +
                        "احتیاجات نوری و حرارتی گیاه را دقیقا مدنظر داشته باشید.\n" +
                        "برگ های ریز و شوید مانند آن و انشعاب های متعدد شاخه اصلی به برگچه های ریز سبز و براق منظره جالب و بدیعی خلق می کند. که اگر نیاز رطوبتی و نوری آن برآورده نگردد این منظره زیبا تبدیل به برگ های خشک و بد منظر خواهند گردید. این گیاه ارتفاعی در حدود 80 سانتیمتر به خود می گیرد و هرچه گلدان بزرگ تر و گیاه بالغ تر باشد منظره آن زیباتر است.زیبایی آن زمانی به اوج می رسد که در کاشت گروهی با گیاهان دیگر از نظر شکلی مورد مقایسه قرار گیرد.\n")
                .withCommonName("shevedi.jpg")
                .withSpecs(specs13)
                .withFavourite(false)
                .build();

        List<Spec> specs14 = new ArrayList<>();
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));

        PlantEntity plant14 = new PlantEntity.Builder()
                .withName("")
                .withEnName("")
                .withNameRoot("")
                .withIdentity("")
                .withCommonName("")
                .withSpecs(specs14)
                .withFavourite(false)
                .build();

        List<Spec> specs15 = new ArrayList<>();
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));
        specs4.add(new Spec("",""));

        PlantEntity plant15 = new PlantEntity.Builder()
                .withName("")
                .withEnName("")
                .withNameRoot("")
                .withIdentity("")
                .withCommonName("")
                .withSpecs(specs15)
                .withFavourite(false)
                .build();



        entities.add(plant1);
        entities.add(plant2);
        entities.add(plant3);
        entities.add(plant4);
        entities.add(plant5);
        entities.add(plant6);
        entities.add(plant7);
        entities.add(plant8);
        entities.add(plant9);
        entities.add(plant10);
        entities.add(plant11);
        entities.add(plant12);
        entities.add(plant13);
        entities.add(plant14);
        entities.add(plant15);

        return entities;
    }

    /**
     *
     * in case you want to load data from assets folder
     *
     * @param context for getting assets folder
     * @param fileName name of the asset file
     * @return a list of plants
     *
     *
     */
    public static List<PlantEntity> loadAssetPlants(Context context,String fileName) {
        String json = null;
        try {
            InputStream inputStream = context.getAssets().open(fileName);
            int size = inputStream.available();
            byte[] buffer = new byte[size];
            inputStream.read(buffer);
            inputStream.close();
            json = new String(buffer, StandardCharsets.UTF_8);

        } catch (IOException e) {
            e.printStackTrace();
            return null;
        }

        Type plantType = new TypeToken<List<PlantEntity>>() {}.getType();
        Gson gson = new Gson();
        return gson.fromJson(json,plantType);
    }

}
